//DUMMYJCL JOB ,'PMMS DUMMY',CLASS=A,MSGCLASS=H
//             USER=HERC01,PASSWORD=CUL8TR
/*JOBPARM ROOM=PMMS
//************************************************                      00000300
//* DOES NOTHING. IT'S USED FOR TESTING PURPOSES                        00000400
//************************************************                      00000500
//JOBCARD
//STEP1
