//DUMMYJCL JOB ,'PMMS DUMMY',CLASS=A,MSGCLASS=H                         00000100
//             USER=HERC01,PASSWORD=CUL8TR                              00000200
/*JOBPARM ROOM=PMMS                                                     00000300
//************************************************                      00000400
//* DOES NOTHING. IT'S USED FOR TESTING PURPOSES                        00000500
//************************************************                      00000600
//JOBCARD                                                               00000700
//STEP1                                                                 00000800
