//DUMMYJCL JOB 'JCL DUMMY',CLASS=A,MSGCLASS=H,
// USER=HERC01,PASSWORD=CUL8TR
//*******************************************************************
//* DOES NOTHING. IT'S USED FOR TESTING PURPOSES
//*******************************************************************
//STEP01
//STEP02
//STEP03
